[Survived] BooleanLiteral
ServerCliente.js:17:40
 
 // Middleware nativi di Express
 app.use(express.static(STATIC_DIR));
-app.use(express.urlencoded({ extended: true }));
+app.use(express.urlencoded({ extended: false }));
 app.use(express.json());
 app.use(cookieParser());

[Killed] ObjectLiteral
ServerCliente.js:17:28
 
 // Middleware nativi di Express
 app.use(express.static(STATIC_DIR));
-app.use(express.urlencoded({ extended: true }));
+app.use(express.urlencoded({}));
 app.use(express.json());
 app.use(cookieParser());
killedBy: All tests
statusReason: Tue, 14 Jul 2026 20:35:43 GMT body-parser deprecated undefined extended: provide extended option at serverCliente.js:63:17

node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:27:45
 // Da qui in poi, l'identità dell'utente per ogni operazione
 // protetta viene letta da req.nomeAutenticato, mai da req.body.
 // ============================================================
-function requireClienteAuth(req, res, next) {
-  const nome = req.cookies && req.cookies.session;
-  if (!nome) {
-    return res.status(401).json({ message: 'Sessione non valida: effettua il login' });
-  }
-  req.nomeAutenticato = nome;
-  next();
-}
+function requireClienteAuth(req, res, next) {}
 
 // ============================================================
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:28:16
 // protetta viene letta da req.nomeAutenticato, mai da req.body.
 // ============================================================
 function requireClienteAuth(req, res, next) {
-  const nome = req.cookies && req.cookies.session;
+  const nome = true;
   if (!nome) {
     return res.status(401).json({ message: 'Sessione non valida: effettua il login' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] LogicalOperator
ServerCliente.js:28:16
 // protetta viene letta da req.nomeAutenticato, mai da req.body.
 // ============================================================
 function requireClienteAuth(req, res, next) {
-  const nome = req.cookies && req.cookies.session;
+  const nome = req.cookies || req.cookies.session;
   if (!nome) {
     return res.status(401).json({ message: 'Sessione non valida: effettua il login' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:29:7
 // ============================================================
 function requireClienteAuth(req, res, next) {
   const nome = req.cookies && req.cookies.session;
-  if (!nome) {
+  if (false) {
     return res.status(401).json({ message: 'Sessione non valida: effettua il login' });
   }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:29:14
 // ============================================================
 function requireClienteAuth(req, res, next) {
   const nome = req.cookies && req.cookies.session;
-  if (!nome) {
-    return res.status(401).json({ message: 'Sessione non valida: effettua il login' });
-  }
+  if (!nome) {}
   req.nomeAutenticato = nome;
   next();
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:30:44
 function requireClienteAuth(req, res, next) {
   const nome = req.cookies && req.cookies.session;
   if (!nome) {
-    return res.status(401).json({ message: 'Sessione non valida: effettua il login' });
+    return res.status(401).json({ message: "" });
   }
   req.nomeAutenticato = nome;
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:39:28
 // ============================================================
 // FIX #2: Mantenuto - Route esplicita per la home page cliente
 // ============================================================
-app.get('/', (req, res) => {
-  res.sendFile(path.join(STATIC_DIR, 'Cliente.html'));
-});
+app.get('/', (req, res) => {});
 
 // Connessione MongoDB (utilizzato l'IP standard 127.0.0.1 per stabilità su ambienti Unix/Mac)
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:39:9
 // ============================================================
 // FIX #2: Mantenuto - Route esplicita per la home page cliente
 // ============================================================
-app.get('/', (req, res) => {
+app.get("", (req, res) => {
   res.sendFile(path.join(STATIC_DIR, 'Cliente.html'));
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:45:9
 
 // Connessione MongoDB (utilizzato l'IP standard 127.0.0.1 per stabilità su ambienti Unix/Mac)
 mongoose.connect('mongodb://127.0.0.1:27017/Cliente')
-  .then(() => console.log('Connessione con MongoDB avvenuta con successo'))
+  .then(() => undefined)
   .catch((error) => console.error('ERRORE CONNESSIONE CON MONGODB NON RIUSCITA:', error));
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:45:27
 
 // Connessione MongoDB (utilizzato l'IP standard 127.0.0.1 per stabilità su ambienti Unix/Mac)
 mongoose.connect('mongodb://127.0.0.1:27017/Cliente')
-  .then(() => console.log('Connessione con MongoDB avvenuta con successo'))
+  .then(() => console.log(""))
   .catch((error) => console.error('ERRORE CONNESSIONE CON MONGODB NON RIUSCITA:', error));
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:46:10
 // Connessione MongoDB (utilizzato l'IP standard 127.0.0.1 per stabilità su ambienti Unix/Mac)
 mongoose.connect('mongodb://127.0.0.1:27017/Cliente')
   .then(() => console.log('Connessione con MongoDB avvenuta con successo'))
-  .catch((error) => console.error('ERRORE CONNESSIONE CON MONGODB NON RIUSCITA:', error));
+  .catch(() => undefined);
 
 // --- SCHEMAS E MODELLI ---
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:46:35
 // Connessione MongoDB (utilizzato l'IP standard 127.0.0.1 per stabilità su ambienti Unix/Mac)
 mongoose.connect('mongodb://127.0.0.1:27017/Cliente')
   .then(() => console.log('Connessione con MongoDB avvenuta con successo'))
-  .catch((error) => console.error('ERRORE CONNESSIONE CON MONGODB NON RIUSCITA:', error));
+  .catch((error) => console.error("", error));
 
 // --- SCHEMAS E MODELLI ---
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:50:43
 
 // --- SCHEMAS E MODELLI ---
 
-const ClienteSchema = new mongoose.Schema({
-  nome: { type: String, required: true, unique: true, trim: true },
-  password: { type: String, required: true },
-  numero: {
-    type: String,
-    required: true,
-    unique: true,
-    validate: {
-      validator: (v) => /^\d{10}$/.test(v),
-      message: (props) => `Numero di telefono non valido ('${props.value}'): deve contenere esattamente 10 cifre.`
-    }
-  },
-  carta: {
-    type: String,
-    required: true,
-    validate: {
-      validator: (v) => /^\d{16}$/.test(v),
-      message: (props) => `Numero di carta non valido: deve contenere esattamente 16 cifre.`
-    }
-  }
-});
+const ClienteSchema = new mongoose.Schema({});
 const Cliente = mongoose.model('Cliente', ClienteSchema);
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:51:49
 // --- SCHEMAS E MODELLI ---
 
 const ClienteSchema = new mongoose.Schema({
-  nome: { type: String, required: true, unique: true, trim: true },
+  nome: { type: String, required: true, unique: false, trim: true },
   password: { type: String, required: true },
   numero: {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:51:61
 // --- SCHEMAS E MODELLI ---
 
 const ClienteSchema = new mongoose.Schema({
-  nome: { type: String, required: true, unique: true, trim: true },
+  nome: { type: String, required: true, unique: true, trim: false },
   password: { type: String, required: true },
   numero: {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:52:39
 
 const ClienteSchema = new mongoose.Schema({
   nome: { type: String, required: true, unique: true, trim: true },
-  password: { type: String, required: true },
+  password: { type: String, required: false },
   numero: {
     type: String,
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:52:13
 
 const ClienteSchema = new mongoose.Schema({
   nome: { type: String, required: true, unique: true, trim: true },
-  password: { type: String, required: true },
+  password: {},
   numero: {
     type: String,
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:56:13
   numero: {
     type: String,
     required: true,
-    unique: true,
+    unique: false,
     validate: {
       validator: (v) => /^\d{10}$/.test(v),
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Survived] ArrowFunction
ServerCliente.js:58:18
     required: true,
     unique: true,
     validate: {
-      validator: (v) => /^\d{10}$/.test(v),
+      validator: () => undefined,
       message: (props) => `Numero di telefono non valido ('${props.value}'): deve contenere esattamente 10 cifre.`
     }

[Killed] Regex
ServerCliente.js:58:25
     required: true,
     unique: true,
     validate: {
-      validator: (v) => /^\d{10}$/.test(v),
+      validator: (v) => /^\d{10}/.test(v),
       message: (props) => `Numero di telefono non valido ('${props.value}'): deve contenere esattamente 10 cifre.`
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:59:16
     unique: true,
     validate: {
       validator: (v) => /^\d{10}$/.test(v),
-      message: (props) => `Numero di telefono non valido ('${props.value}'): deve contenere esattamente 10 cifre.`
+      message: () => undefined
     }
   },
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:66:18
     type: String,
     required: true,
     validate: {
-      validator: (v) => /^\d{16}$/.test(v),
+      validator: () => undefined,
       message: (props) => `Numero di carta non valido: deve contenere esattamente 16 cifre.`
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] Regex
ServerCliente.js:66:25
     type: String,
     required: true,
     validate: {
-      validator: (v) => /^\d{16}$/.test(v),
+      validator: (v) => /^\d$/.test(v),
       message: (props) => `Numero di carta non valido: deve contenere esattamente 16 cifre.`
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:67:16
     required: true,
     validate: {
       validator: (v) => /^\d{16}$/.test(v),
-      message: (props) => `Numero di carta non valido: deve contenere esattamente 16 cifre.`
+      message: () => undefined
     }
   }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:71:32
     }
   }
 });
-const Cliente = mongoose.model('Cliente', ClienteSchema);
+const Cliente = mongoose.model("", ClienteSchema);
 
 const CarrelloSchema = new mongoose.Schema({
killedBy: All tests
statusReason: Server Cliente in ascolto sulla porta 3001

Connessione con MongoDB avvenuta con successo

Credenziali non valide

Utente aggiunto nel DB

[Killed] StringLiteral
ServerCliente.js:78:33
   codice: String,
   prezzo: String
 });
-const Carrello = mongoose.model('Carrello', CarrelloSchema);
+const Carrello = mongoose.model("", CarrelloSchema);
 
 const OrdineSchema = new mongoose.Schema({
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:86:5
   data: String,
   prezzo: Number,
   prodottiAcquistati: [
-    {
-      codice: String,
-      prezzo: String,
-      quantita: Number
-    }
+    {}
   ]
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrayDeclaration
ServerCliente.js:101:14
   nome: String,
   descrizione: String,
   immagine1: [Buffer],
-  immagine2: [Buffer],
+  immagine2: [],
   immagine3: [Buffer],
   immagine4: [Buffer],
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:122:45
 
 // File Paths Relativi
 const opereFilePath = path.join(__dirname, 'Opere.json');
-const ordiniFilePath = path.join(__dirname, 'Ordini.json');
+const ordiniFilePath = path.join(__dirname, "");
 const vendiOpereFilePath = path.join(__dirname, 'VendiOpere.json');
 const richiesteFilePath = path.join(__dirname, 'Richieste.json');
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:124:48
 const opereFilePath = path.join(__dirname, 'Opere.json');
 const ordiniFilePath = path.join(__dirname, 'Ordini.json');
 const vendiOpereFilePath = path.join(__dirname, 'VendiOpere.json');
-const richiesteFilePath = path.join(__dirname, 'Richieste.json');
+const richiesteFilePath = path.join(__dirname, "");
 const statoFilePath = path.join(__dirname, 'stato.json');
 const reportVenditeFilePath = path.join(__dirname, 'ReportVendite.json');
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:125:44
 const ordiniFilePath = path.join(__dirname, 'Ordini.json');
 const vendiOpereFilePath = path.join(__dirname, 'VendiOpere.json');
 const richiesteFilePath = path.join(__dirname, 'Richieste.json');
-const statoFilePath = path.join(__dirname, 'stato.json');
+const statoFilePath = path.join(__dirname, "");
 const reportVenditeFilePath = path.join(__dirname, 'ReportVendite.json');
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:130:62
 
 // --- HELPER FUNCTIONS ---
 
-function simulateSendSMS(numeroUtente, smsMessage, messaggi) {
-  console.log('Simulazione SMS inviato a', numeroUtente, 'con il messaggio:', smsMessage);
-  console.log('Messaggi dettagliati:', messaggi);
-}
+function simulateSendSMS(numeroUtente, smsMessage, messaggi) {}
 
 function getCurrentDate() {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:135:27
   console.log('Messaggi dettagliati:', messaggi);
 }
 
-function getCurrentDate() {
-  const today = new Date();
-  const year = today.getFullYear();
-  const month = String(today.getMonth() + 1).padStart(2, '0');
-  const day = String(today.getDate()).padStart(2, '0');
-  return `${year}-${month}-${day}`;
-}
+function getCurrentDate() {}
 
 // Helper per aggiornare i file JSON in modo sicuro senza corrompere la sintassi degli array
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArithmeticOperator
ServerCliente.js:138:24
 function getCurrentDate() {
   const today = new Date();
   const year = today.getFullYear();
-  const month = String(today.getMonth() + 1).padStart(2, '0');
+  const month = String(today.getMonth() - 1).padStart(2, '0');
   const day = String(today.getDate()).padStart(2, '0');
   return `${year}-${month}-${day}`;
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:139:51
   const today = new Date();
   const year = today.getFullYear();
   const month = String(today.getMonth() + 1).padStart(2, '0');
-  const day = String(today.getDate()).padStart(2, '0');
+  const day = String(today.getDate()).padStart(2, "");
   return `${year}-${month}-${day}`;
 }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:140:10
   const year = today.getFullYear();
   const month = String(today.getMonth() + 1).padStart(2, '0');
   const day = String(today.getDate()).padStart(2, '0');
-  return `${year}-${month}-${day}`;
+  return ``;
 }
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:144:50
 }
 
 // Helper per aggiornare i file JSON in modo sicuro senza corrompere la sintassi degli array
-function safeAppendToJsonFile(filePath, newItem) {
-  let list = [];
-  if (fs.existsSync(filePath)) {
-    try {
-      const fileData = fs.readFileSync(filePath, 'utf-8');
-      list = fileData ? JSON.parse(fileData) : [];
-    } catch (e) {
-      list = [];
-    }
-  }
-  list.push(newItem);
-  fs.writeFileSync(filePath, JSON.stringify(list, null, 2), 'utf-8');
-}
+function safeAppendToJsonFile(filePath, newItem) {}
 
 // --- ROTTE API ---
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:146:32
 // Helper per aggiornare i file JSON in modo sicuro senza corrompere la sintassi degli array
 function safeAppendToJsonFile(filePath, newItem) {
   let list = [];
-  if (fs.existsSync(filePath)) {
-    try {
-      const fileData = fs.readFileSync(filePath, 'utf-8');
-      list = fileData ? JSON.parse(fileData) : [];
-    } catch (e) {
-      list = [];
-    }
-  }
+  if (fs.existsSync(filePath)) {}
   list.push(newItem);
   fs.writeFileSync(filePath, JSON.stringify(list, null, 2), 'utf-8');
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:146:7
 // Helper per aggiornare i file JSON in modo sicuro senza corrompere la sintassi degli array
 function safeAppendToJsonFile(filePath, newItem) {
   let list = [];
-  if (fs.existsSync(filePath)) {
+  if (false) {
     try {
       const fileData = fs.readFileSync(filePath, 'utf-8');
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:147:9
 function safeAppendToJsonFile(filePath, newItem) {
   let list = [];
   if (fs.existsSync(filePath)) {
-    try {
-      const fileData = fs.readFileSync(filePath, 'utf-8');
-      list = fileData ? JSON.parse(fileData) : [];
-    } catch (e) {
+    try {} catch (e) {
       list = [];
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:150:17
     try {
       const fileData = fs.readFileSync(filePath, 'utf-8');
       list = fileData ? JSON.parse(fileData) : [];
-    } catch (e) {
-      list = [];
-    }
+    } catch (e) {}
   }
   list.push(newItem);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:162:7
 
 // REGISTRAZIONE
 app.post('/registrazione', async (req, res) => {
-  try {
-    // FIX #4: la password non viene più salvata in chiaro. bcryptjs è puro JS
-    // (nessuna compilazione nativa richiesta), scelto apposta per restare
-    // facilmente replicabile su qualunque macchina senza toolchain C++.
-    const passwordHash = await bcrypt.hash(req.body.password, SALT_ROUNDS);
-
-    const newCliente = new Cliente({
-      nome: req.body.nome,
-      password: passwordHash,
-      numero: req.body.numero,
-      carta: req.body.carta
-    });
-    await newCliente.save();
-    console.log('Utente aggiunto nel DB');
-
-    // Non ripetiamo più la password (nemmeno l'hash) nella risposta al client.
-    const riepilogo = `UTENTE REGISTRATO nome:${newCliente.nome} numero:${newCliente.numero} carta:${newCliente.carta}`;
-    res.json({ riepilogo });
-  } catch (err) {
+  try {} catch (err) {
     console.error('Errore durante la registrazione:', err);
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:180:17
     // Non ripetiamo più la password (nemmeno l'hash) nella risposta al client.
     const riepilogo = `UTENTE REGISTRATO nome:${newCliente.nome} numero:${newCliente.numero} carta:${newCliente.carta}`;
     res.json({ riepilogo });
-  } catch (err) {
-    console.error('Errore durante la registrazione:', err);
-
-    // Violazione di un vincolo 'unique' (nome o numero già registrati)
-    if (err.code === 11000) {
-      const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
-      const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
-      return res.status(409).json({ message: `Registrazione fallita: ${nomeCampo} già in uso.` });
-    }
-
-    // Errore di validazione Mongoose (es. numero non a 10 cifre, carta non a 16 cifre)
-    if (err.name === 'ValidationError') {
-      const primoErrore = Object.values(err.errors)[0];
-      return res.status(400).json({ message: primoErrore.message });
-    }
-
-    res.status(500).json({ message: 'Errore durante la registrazione' });
-  }
+  } catch (err) {}
 });
 // ============================================================
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:184:9
     console.error('Errore durante la registrazione:', err);
 
     // Violazione di un vincolo 'unique' (nome o numero già registrati)
-    if (err.code === 11000) {
+    if (false) {
       const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
       const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:184:29
     console.error('Errore durante la registrazione:', err);
 
     // Violazione di un vincolo 'unique' (nome o numero già registrati)
-    if (err.code === 11000) {
-      const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
-      const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
-      return res.status(409).json({ message: `Registrazione fallita: ${nomeCampo} già in uso.` });
-    }
+    if (err.code === 11000) {}
 
     // Errore di validazione Mongoose (es. numero non a 10 cifre, carta non a 16 cifre)
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] LogicalOperator
ServerCliente.js:185:21
 
     // Violazione di un vincolo 'unique' (nome o numero già registrati)
     if (err.code === 11000) {
-      const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
+      const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] && 'dato';
       const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
       return res.status(409).json({ message: `Registrazione fallita: ${nomeCampo} già in uso.` });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:185:21
 
     // Violazione di un vincolo 'unique' (nome o numero già registrati)
     if (err.code === 11000) {
-      const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
+      const campo = false;
       const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
       return res.status(409).json({ message: `Registrazione fallita: ${nomeCampo} già in uso.` });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:186:60
     // Violazione di un vincolo 'unique' (nome o numero già registrati)
     if (err.code === 11000) {
       const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
-      const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
+      const nomeCampo = campo === 'nome' ? 'nome utente' : false ? 'numero di telefono' : campo;
       return res.status(409).json({ message: `Registrazione fallita: ${nomeCampo} già in uso.` });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:186:60
     // Violazione di un vincolo 'unique' (nome o numero già registrati)
     if (err.code === 11000) {
       const campo = Object.keys(err.keyPattern || err.keyValue || {})[0] || 'dato';
-      const nomeCampo = campo === 'nome' ? 'nome utente' : campo === 'numero' ? 'numero di telefono' : campo;
+      const nomeCampo = campo === 'nome' ? 'nome utente' : true ? 'numero di telefono' : campo;
       return res.status(409).json({ message: `Registrazione fallita: ${nomeCampo} già in uso.` });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:191:9
     }
 
     // Errore di validazione Mongoose (es. numero non a 10 cifre, carta non a 16 cifre)
-    if (err.name === 'ValidationError') {
+    if (true) {
       const primoErrore = Object.values(err.errors)[0];
       return res.status(400).json({ message: primoErrore.message });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001
