[Killed] BlockStatement
ServerCliente.js:191:41
     }
 
     // Errore di validazione Mongoose (es. numero non a 10 cifre, carta non a 16 cifre)
-    if (err.name === 'ValidationError') {
-      const primoErrore = Object.values(err.errors)[0];
-      return res.status(400).json({ message: primoErrore.message });
-    }
+    if (err.name === 'ValidationError') {}
 
     res.status(500).json({ message: 'Errore durante la registrazione' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:196:26
       return res.status(400).json({ message: primoErrore.message });
     }
 
-    res.status(500).json({ message: 'Errore durante la registrazione' });
+    res.status(500).json({});
   }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:196:37
       return res.status(400).json({ message: primoErrore.message });
     }
 
-    res.status(500).json({ message: 'Errore durante la registrazione' });
+    res.status(500).json({ message: "" });
   }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:204:10
 // ============================================================
 
 // LOGIN
-app.post('/login', async (req, res) => {
+app.post("", async (req, res) => {
   const { nome, password } = req.body;
   try {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:206:7
 // LOGIN
 app.post('/login', async (req, res) => {
   const { nome, password } = req.body;
-  try {
-    // FIX #4: non possiamo più cercare {nome, password} in un colpo solo,
-    // perché la password è ora un hash: cerchiamo prima l'utente per nome,
-    // poi confrontiamo la password in chiaro ricevuta con l'hash salvato.
-    // (LoginCliente è stata rimossa: Cliente è ora l'unica fonte di verità
-    // per le credenziali, niente più rischio di disallineamento tra due tabelle.)
-    const result = await Cliente.findOne({ nome });
-    const credenzialiValide = result && await bcrypt.compare(password, result.password);
-
-    if (credenzialiValide) {
-      console.log('Accesso effettuato da:', nome);
-
-      // Scrittura del cookie di sessione (FSM Stato S2)
-      res.cookie('session', nome, {
-        httpOnly: true,
-        maxAge: 1000 * 60 * 60 * 2 // Validità: 2 ore
-      });
-
-      res.json({ message: 'Accesso effettuato con successo', nome });
-    } else {
-      console.log('Credenziali non valide');
-      res.status(401).json({ message: 'Credenziali non valide' });
-    }
-  } catch (err) {
+  try {} catch (err) {
     console.error('Errore durante il login:', err);
     res.status(500).json({ message: 'Errore durante il login' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] LogicalOperator
ServerCliente.js:213:31
     // (LoginCliente è stata rimossa: Cliente è ora l'unica fonte di verità
     // per le credenziali, niente più rischio di disallineamento tra due tabelle.)
     const result = await Cliente.findOne({ nome });
-    const credenzialiValide = result && await bcrypt.compare(password, result.password);
+    const credenzialiValide = result || (await bcrypt.compare(password, result.password));
 
     if (credenzialiValide) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:213:31
     // (LoginCliente è stata rimossa: Cliente è ora l'unica fonte di verità
     // per le credenziali, niente più rischio di disallineamento tra due tabelle.)
     const result = await Cliente.findOne({ nome });
-    const credenzialiValide = result && await bcrypt.compare(password, result.password);
+    const credenzialiValide = true;
 
     if (credenzialiValide) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:215:9
     const result = await Cliente.findOne({ nome });
     const credenzialiValide = result && await bcrypt.compare(password, result.password);
 
-    if (credenzialiValide) {
+    if (true) {
       console.log('Accesso effettuato da:', nome);
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:215:9
     const result = await Cliente.findOne({ nome });
     const credenzialiValide = result && await bcrypt.compare(password, result.password);
 
-    if (credenzialiValide) {
+    if (false) {
       console.log('Accesso effettuato da:', nome);
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:220:19
 
       // Scrittura del cookie di sessione (FSM Stato S2)
       res.cookie('session', nome, {
-        httpOnly: true,
+        httpOnly: false,
         maxAge: 1000 * 60 * 60 * 2 // Validità: 2 ore
       });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArithmeticOperator
ServerCliente.js:221:17
       // Scrittura del cookie di sessione (FSM Stato S2)
       res.cookie('session', nome, {
         httpOnly: true,
-        maxAge: 1000 * 60 * 60 * 2 // Validità: 2 ore
+        maxAge: 1000 * 60 / 60 * 2 // Validità: 2 ore
       });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArithmeticOperator
ServerCliente.js:221:17
       // Scrittura del cookie di sessione (FSM Stato S2)
       res.cookie('session', nome, {
         httpOnly: true,
-        maxAge: 1000 * 60 * 60 * 2 // Validità: 2 ore
+        maxAge: 1000 * 60 * 60 / 2 // Validità: 2 ore
       });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:225:12
       });
 
       res.json({ message: 'Accesso effettuato con successo', nome });
-    } else {
-      console.log('Credenziali non valide');
-      res.status(401).json({ message: 'Credenziali non valide' });
-    }
+    } else {}
   } catch (err) {
     console.error('Errore durante il login:', err);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:227:28
       res.json({ message: 'Accesso effettuato con successo', nome });
     } else {
       console.log('Credenziali non valide');
-      res.status(401).json({ message: 'Credenziali non valide' });
+      res.status(401).json({});
     }
   } catch (err) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:227:39
       res.json({ message: 'Accesso effettuato con successo', nome });
     } else {
       console.log('Credenziali non valide');
-      res.status(401).json({ message: 'Credenziali non valide' });
+      res.status(401).json({ message: "" });
     }
   } catch (err) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:229:17
       console.log('Credenziali non valide');
       res.status(401).json({ message: 'Credenziali non valide' });
     }
-  } catch (err) {
-    console.error('Errore durante il login:', err);
-    res.status(500).json({ message: 'Errore durante il login' });
-  }
+  } catch (err) {}
 });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:230:19
       res.status(401).json({ message: 'Credenziali non valide' });
     }
   } catch (err) {
-    console.error('Errore durante il login:', err);
+    console.error("", err);
     res.status(500).json({ message: 'Errore durante il login' });
   }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:231:26
     }
   } catch (err) {
     console.error('Errore durante il login:', err);
-    res.status(500).json({ message: 'Errore durante il login' });
+    res.status(500).json({});
   }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:236:47
 });
 
 // CHECK SESSION 
-app.get('/checkSessionCliente', (req, res) => {
-    const nome = req.cookies && req.cookies.session;
-    if (nome) {
-        res.json({ success: true, message: "Sessione client valida", nome });
-    } else {
-        res.status(401).json({ success: false, message: "Sessione non trovata" });
-    }
-});
+app.get('/checkSessionCliente', (req, res) => {});
 
 // LOGOUT 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:236:9
 });
 
 // CHECK SESSION 
-app.get('/checkSessionCliente', (req, res) => {
+app.get("", (req, res) => {
     const nome = req.cookies && req.cookies.session;
     if (nome) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:237:18
 
 // CHECK SESSION 
 app.get('/checkSessionCliente', (req, res) => {
-    const nome = req.cookies && req.cookies.session;
+    const nome = true;
     if (nome) {
         res.json({ success: true, message: "Sessione client valida", nome });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:237:18
 
 // CHECK SESSION 
 app.get('/checkSessionCliente', (req, res) => {
-    const nome = req.cookies && req.cookies.session;
+    const nome = false;
     if (nome) {
         res.json({ success: true, message: "Sessione client valida", nome });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:238:9
 // CHECK SESSION 
 app.get('/checkSessionCliente', (req, res) => {
     const nome = req.cookies && req.cookies.session;
-    if (nome) {
+    if (false) {
         res.json({ success: true, message: "Sessione client valida", nome });
     } else {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:238:15
 // CHECK SESSION 
 app.get('/checkSessionCliente', (req, res) => {
     const nome = req.cookies && req.cookies.session;
-    if (nome) {
-        res.json({ success: true, message: "Sessione client valida", nome });
-    } else {
+    if (nome) {} else {
         res.status(401).json({ success: false, message: "Sessione non trovata" });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:239:29
 app.get('/checkSessionCliente', (req, res) => {
     const nome = req.cookies && req.cookies.session;
     if (nome) {
-        res.json({ success: true, message: "Sessione client valida", nome });
+        res.json({ success: false, message: "Sessione client valida", nome });
     } else {
         res.status(401).json({ success: false, message: "Sessione non trovata" });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:239:18
 app.get('/checkSessionCliente', (req, res) => {
     const nome = req.cookies && req.cookies.session;
     if (nome) {
-        res.json({ success: true, message: "Sessione client valida", nome });
+        res.json({});
     } else {
         res.status(401).json({ success: false, message: "Sessione non trovata" });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:240:12
     const nome = req.cookies && req.cookies.session;
     if (nome) {
         res.json({ success: true, message: "Sessione client valida", nome });
-    } else {
-        res.status(401).json({ success: false, message: "Sessione non trovata" });
-    }
+    } else {}
 });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:241:41
     if (nome) {
         res.json({ success: true, message: "Sessione client valida", nome });
     } else {
-        res.status(401).json({ success: false, message: "Sessione non trovata" });
+        res.status(401).json({ success: true, message: "Sessione non trovata" });
     }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:246:34
 });
 
 // LOGOUT 
-app.get('/logout', (req, res) => {
-  res.clearCookie('session');
-  res.json({ message: 'Logout effettuato con successo' });
-});
+app.get('/logout', (req, res) => {});
 
 // VISUALIZZA CATALOGO
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:246:9
 });
 
 // LOGOUT 
-app.get('/logout', (req, res) => {
+app.get("", (req, res) => {
   res.clearCookie('session');
   res.json({ message: 'Logout effettuato con successo' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:247:19
 
 // LOGOUT 
 app.get('/logout', (req, res) => {
-  res.clearCookie('session');
+  res.clearCookie("");
   res.json({ message: 'Logout effettuato con successo' });
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:252:38
 });
 
 // VISUALIZZA CATALOGO
-app.get('/visualizza', (req, res) => {
-  if (!fs.existsSync(opereFilePath)) return res.json([]);
-  fs.readFile(opereFilePath, 'utf-8', (err, data) => {
-    if (err) {
-      console.error('Errore durante la lettura del catalogo:', err);
-      return res.status(500).json({ message: 'Errore di lettura del catalogo' });
-    }
-    res.json(JSON.parse(data || '[]'));
-  });
-});
+app.get('/visualizza', (req, res) => {});
 
 // AGGIUNGI OPERA AL CARRELLO
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:252:9
 });
 
 // VISUALIZZA CATALOGO
-app.get('/visualizza', (req, res) => {
+app.get("", (req, res) => {
   if (!fs.existsSync(opereFilePath)) return res.json([]);
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BooleanLiteral
ServerCliente.js:253:7
 
 // VISUALIZZA CATALOGO
 app.get('/visualizza', (req, res) => {
-  if (!fs.existsSync(opereFilePath)) return res.json([]);
+  if (fs.existsSync(opereFilePath)) return res.json([]);
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
     if (err) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:253:7
 
 // VISUALIZZA CATALOGO
 app.get('/visualizza', (req, res) => {
-  if (!fs.existsSync(opereFilePath)) return res.json([]);
+  if (false) return res.json([]);
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
     if (err) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:254:54
 // VISUALIZZA CATALOGO
 app.get('/visualizza', (req, res) => {
   if (!fs.existsSync(opereFilePath)) return res.json([]);
-  fs.readFile(opereFilePath, 'utf-8', (err, data) => {
-    if (err) {
-      console.error('Errore durante la lettura del catalogo:', err);
-      return res.status(500).json({ message: 'Errore di lettura del catalogo' });
-    }
-    res.json(JSON.parse(data || '[]'));
-  });
+  fs.readFile(opereFilePath, 'utf-8', (err, data) => {});
 });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:254:30
 // VISUALIZZA CATALOGO
 app.get('/visualizza', (req, res) => {
   if (!fs.existsSync(opereFilePath)) return res.json([]);
-  fs.readFile(opereFilePath, 'utf-8', (err, data) => {
+  fs.readFile(opereFilePath, "", (err, data) => {
     if (err) {
       console.error('Errore durante la lettura del catalogo:', err);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:255:9
 app.get('/visualizza', (req, res) => {
   if (!fs.existsSync(opereFilePath)) return res.json([]);
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
-    if (err) {
+    if (false) {
       console.error('Errore durante la lettura del catalogo:', err);
       return res.status(500).json({ message: 'Errore di lettura del catalogo' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:255:9
 app.get('/visualizza', (req, res) => {
   if (!fs.existsSync(opereFilePath)) return res.json([]);
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
-    if (err) {
+    if (true) {
       console.error('Errore durante la lettura del catalogo:', err);
       return res.status(500).json({ message: 'Errore di lettura del catalogo' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:256:21
   if (!fs.existsSync(opereFilePath)) return res.json([]);
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
     if (err) {
-      console.error('Errore durante la lettura del catalogo:', err);
+      console.error("", err);
       return res.status(500).json({ message: 'Errore di lettura del catalogo' });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:257:35
   fs.readFile(opereFilePath, 'utf-8', (err, data) => {
     if (err) {
       console.error('Errore durante la lettura del catalogo:', err);
-      return res.status(500).json({ message: 'Errore di lettura del catalogo' });
+      return res.status(500).json({});
     }
     res.json(JSON.parse(data || '[]'));
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:259:25
       console.error('Errore durante la lettura del catalogo:', err);
       return res.status(500).json({ message: 'Errore di lettura del catalogo' });
     }
-    res.json(JSON.parse(data || '[]'));
+    res.json(JSON.parse(false));
   });
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] LogicalOperator
ServerCliente.js:259:25
       console.error('Errore durante la lettura del catalogo:', err);
       return res.status(500).json({ message: 'Errore di lettura del catalogo' });
     }
-    res.json(JSON.parse(data || '[]'));
+    res.json(JSON.parse(data && '[]'));
   });
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:265:71
 
 // AGGIUNGI OPERA AL CARRELLO
 // AGGIUNGI OPERA AL CARRELLO
-app.post('/aggiungiCarrello', requireClienteAuth, async (req, res) => {
-  try {
-    let opere = [];
-    if (fs.existsSync(opereFilePath)) {
-      opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
-    }
-    // Recupera il prezzo corrispondente dal catalogo JSON
-    const prezzoCorrispondente = opere.find((opera) => opera.codice === req.body.codice);
-    const prezzoOpera = prezzoCorrispondente ? parseFloat(prezzoCorrispondente.prezzo) : 0;
-
-    // Salva l'elemento nel carrello MongoDB dell'utente autenticato (dal cookie, non dal body)
-    const newCarrello = new Carrello({ 
-      nome: req.nomeAutenticato, 
-      codice: req.body.codice, 
-      prezzo: prezzoOpera 
-    });
-    await newCarrello.save();
-
-    res.json({ message: "Opera aggiunta al carrello con successo!" });
-  } catch (err) {
-    console.error("Errore aggiunta carrello:", err);
-    res.status(500).json({ message: "Errore durante l'aggiunta nel carrello" });
-  }
-});
+app.post('/aggiungiCarrello', requireClienteAuth, async (req, res) => {});
 // ACQUISTA
 app.post('/acquista', requireClienteAuth, async (req, res) => {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:266:7
 // AGGIUNGI OPERA AL CARRELLO
 // AGGIUNGI OPERA AL CARRELLO
 app.post('/aggiungiCarrello', requireClienteAuth, async (req, res) => {
-  try {
-    let opere = [];
-    if (fs.existsSync(opereFilePath)) {
-      opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
-    }
-    // Recupera il prezzo corrispondente dal catalogo JSON
-    const prezzoCorrispondente = opere.find((opera) => opera.codice === req.body.codice);
-    const prezzoOpera = prezzoCorrispondente ? parseFloat(prezzoCorrispondente.prezzo) : 0;
-
-    // Salva l'elemento nel carrello MongoDB dell'utente autenticato (dal cookie, non dal body)
-    const newCarrello = new Carrello({ 
-      nome: req.nomeAutenticato, 
-      codice: req.body.codice, 
-      prezzo: prezzoOpera 
-    });
-    await newCarrello.save();
-
-    res.json({ message: "Opera aggiunta al carrello con successo!" });
-  } catch (err) {
+  try {} catch (err) {
     console.error("Errore aggiunta carrello:", err);
     res.status(500).json({ message: "Errore durante l'aggiunta nel carrello" });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:268:9
 app.post('/aggiungiCarrello', requireClienteAuth, async (req, res) => {
   try {
     let opere = [];
-    if (fs.existsSync(opereFilePath)) {
+    if (true) {
       opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:268:39
 app.post('/aggiungiCarrello', requireClienteAuth, async (req, res) => {
   try {
     let opere = [];
-    if (fs.existsSync(opereFilePath)) {
-      opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
-    }
+    if (fs.existsSync(opereFilePath)) {}
     // Recupera il prezzo corrispondente dal catalogo JSON
     const prezzoCorrispondente = opere.find((opera) => opera.codice === req.body.codice);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:269:26
   try {
     let opere = [];
     if (fs.existsSync(opereFilePath)) {
-      opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
+      opere = JSON.parse(true);
     }
     // Recupera il prezzo corrispondente dal catalogo JSON
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:269:26
   try {
     let opere = [];
     if (fs.existsSync(opereFilePath)) {
-      opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
+      opere = JSON.parse(false);
     }
     // Recupera il prezzo corrispondente dal catalogo JSON
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:272:45
       opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
     }
     // Recupera il prezzo corrispondente dal catalogo JSON
-    const prezzoCorrispondente = opere.find((opera) => opera.codice === req.body.codice);
+    const prezzoCorrispondente = opere.find(() => undefined);
     const prezzoOpera = prezzoCorrispondente ? parseFloat(prezzoCorrispondente.prezzo) : 0;
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] EqualityOperator
ServerCliente.js:272:56
       opere = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
     }
     // Recupera il prezzo corrispondente dal catalogo JSON
-    const prezzoCorrispondente = opere.find((opera) => opera.codice === req.body.codice);
+    const prezzoCorrispondente = opere.find((opera) => opera.codice !== req.body.codice);
     const prezzoOpera = prezzoCorrispondente ? parseFloat(prezzoCorrispondente.prezzo) : 0;
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:276:38
     const prezzoOpera = prezzoCorrispondente ? parseFloat(prezzoCorrispondente.prezzo) : 0;
 
     // Salva l'elemento nel carrello MongoDB dell'utente autenticato (dal cookie, non dal body)
-    const newCarrello = new Carrello({ 
-      nome: req.nomeAutenticato, 
-      codice: req.body.codice, 
-      prezzo: prezzoOpera 
-    });
+    const newCarrello = new Carrello({});
     await newCarrello.save();
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:283:14
     });
     await newCarrello.save();
 
-    res.json({ message: "Opera aggiunta al carrello con successo!" });
+    res.json({});
   } catch (err) {
     console.error("Errore aggiunta carrello:", err);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:284:17
     await newCarrello.save();
 
     res.json({ message: "Opera aggiunta al carrello con successo!" });
-  } catch (err) {
-    console.error("Errore aggiunta carrello:", err);
-    res.status(500).json({ message: "Errore durante l'aggiunta nel carrello" });
-  }
+  } catch (err) {}
 });
 // ACQUISTA
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001
