[Killed] StringLiteral
ServerCliente.js:286:37
     res.json({ message: "Opera aggiunta al carrello con successo!" });
   } catch (err) {
     console.error("Errore aggiunta carrello:", err);
-    res.status(500).json({ message: "Errore durante l'aggiunta nel carrello" });
+    res.status(500).json({ message: "" });
   }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:290:10
   }
 });
 // ACQUISTA
-app.post('/acquista', requireClienteAuth, async (req, res) => {
+app.post("", requireClienteAuth, async (req, res) => {
   try {
     const nomeUtente = req.nomeAutenticato;
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:297:18
     // ha già dimostrato l'identità. Recuperiamo solo il profilo (es. per il numero SMS).
     const result = await Cliente.findOne({ nome: nomeUtente });
 
-    if (!result) {
-      return res.status(404).json({ message: 'Utente non trovato' });
-    }
+    if (!result) {}
 
     const carrello = await Carrello.find({ nome: nomeUtente });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:297:9
     // ha già dimostrato l'identità. Recuperiamo solo il profilo (es. per il numero SMS).
     const result = await Cliente.findOne({ nome: nomeUtente });
 
-    if (!result) {
+    if (false) {
       return res.status(404).json({ message: 'Utente non trovato' });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:298:35
     const result = await Cliente.findOne({ nome: nomeUtente });
 
     if (!result) {
-      return res.status(404).json({ message: 'Utente non trovato' });
+      return res.status(404).json({});
     }
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] EqualityOperator
ServerCliente.js:302:9
     }
 
     const carrello = await Carrello.find({ nome: nomeUtente });
-    if (carrello.length === 0) {
+    if (carrello.length !== 0) {
       return res.json({ message: "Il carrello dell'utente è vuoto" });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:302:9
     }
 
     const carrello = await Carrello.find({ nome: nomeUtente });
-    if (carrello.length === 0) {
+    if (true) {
       return res.json({ message: "Il carrello dell'utente è vuoto" });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:303:23
 
     const carrello = await Carrello.find({ nome: nomeUtente });
     if (carrello.length === 0) {
-      return res.json({ message: "Il carrello dell'utente è vuoto" });
+      return res.json({});
     }
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:307:45
     }
 
     const prodottiAcquisiti = await Promise.all(
-      carrello.map(async (operaCarrello) => {
-        const operaDettagli = await Carrello.findOne({ codice: operaCarrello.codice });
-        return operaDettagli
-          ? { codice: operaDettagli.codice, prezzo: operaDettagli.prezzo, quantita: 1 }
-          : null;
-      })
+      carrello.map(async (operaCarrello) => {})
     );
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] MethodExpression
ServerCliente.js:315:20
       })
     );
 
-    const validi = prodottiAcquisiti.filter(Boolean);
+    const validi = prodottiAcquisiti;
     let somma = 0;
     validi.forEach(p => { somma += Math.floor(Number(p.prezzo || 0)); });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:317:25
 
     const validi = prodottiAcquisiti.filter(Boolean);
     let somma = 0;
-    validi.forEach(p => { somma += Math.floor(Number(p.prezzo || 0)); });
+    validi.forEach(p => {});
 
     const ordineEffettuato = new Ordine({
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:317:54
 
     const validi = prodottiAcquisiti.filter(Boolean);
     let somma = 0;
-    validi.forEach(p => { somma += Math.floor(Number(p.prezzo || 0)); });
+    validi.forEach(p => { somma += Math.floor(Number(false)); });
 
     const ordineEffettuato = new Ordine({
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:319:41
     let somma = 0;
     validi.forEach(p => { somma += Math.floor(Number(p.prezzo || 0)); });
 
-    const ordineEffettuato = new Ordine({
-      id: Math.floor(Math.random() * 100000),
-      utente: nomeUtente,
-      data: getCurrentDate(),
-      prezzo: somma.toFixed(2),
-      prodottiAcquistati: validi
-    });
+    const ordineEffettuato = new Ordine({});
 
     const resultOrdine = await ordineEffettuato.save();
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArithmeticOperator
ServerCliente.js:320:22
     validi.forEach(p => { somma += Math.floor(Number(p.prezzo || 0)); });
 
     const ordineEffettuato = new Ordine({
-      id: Math.floor(Math.random() * 100000),
+      id: Math.floor(Math.random() / 100000),
       utente: nomeUtente,
       data: getCurrentDate(),
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:329:33
 
     const resultOrdine = await ordineEffettuato.save();
 
-    const messaggi = validi.map((opera) => `Hai acquistato l'opera con codice: ${opera.codice} al prezzo di ${opera.prezzo}`);
+    const messaggi = validi.map(() => undefined);
     const alertMessage = 'Grazie per aver acquistato da noi. Il tuo ordine è stato confermato.';
     simulateSendSMS(result.numero, alertMessage, messaggi);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:340:9
     await Carrello.deleteMany({ nome: nomeUtente });
 
     // --- NUOVA LOGICA: RIMOZIONE DAL CATALOGO ---
-    if (fs.existsSync(opereFilePath)) {
+    if (true) {
         let catalogo = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
         
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:340:39
     await Carrello.deleteMany({ nome: nomeUtente });
 
     // --- NUOVA LOGICA: RIMOZIONE DAL CATALOGO ---
-    if (fs.existsSync(opereFilePath)) {
-        let catalogo = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
-        
-        // Estrai tutti i codici dei prodotti acquistati
-        const codiciAcquistati = validi.map(p => p.codice);
-        
-        // Filtra il catalogo mantenendo solo le opere NON acquistate
-        const catalogoAggiornato = catalogo.filter(opera => !codiciAcquistati.includes(opera.codice));
-        
-        // Riscrivi il catalogo aggiornato
-        fs.writeFileSync(opereFilePath, JSON.stringify(catalogoAggiornato, null, 2), 'utf-8');
-        console.log(`Opere rimosse dal catalogo: ${codiciAcquistati.join(', ')}`);
-    }
+    if (fs.existsSync(opereFilePath)) {}
     // ---------------------------------------------
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:341:35
 
     // --- NUOVA LOGICA: RIMOZIONE DAL CATALOGO ---
     if (fs.existsSync(opereFilePath)) {
-        let catalogo = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
+        let catalogo = JSON.parse(true);
         
         // Estrai tutti i codici dei prodotti acquistati
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:341:35
 
     // --- NUOVA LOGICA: RIMOZIONE DAL CATALOGO ---
     if (fs.existsSync(opereFilePath)) {
-        let catalogo = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
+        let catalogo = JSON.parse(false);
         
         // Estrai tutti i codici dei prodotti acquistati
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:344:45
         let catalogo = JSON.parse(fs.readFileSync(opereFilePath, 'utf-8') || '[]');
         
         // Estrai tutti i codici dei prodotti acquistati
-        const codiciAcquistati = validi.map(p => p.codice);
+        const codiciAcquistati = validi.map(() => undefined);
         
         // Filtra il catalogo mantenendo solo le opere NON acquistate
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] MethodExpression
ServerCliente.js:347:36
         const codiciAcquistati = validi.map(p => p.codice);
         
         // Filtra il catalogo mantenendo solo le opere NON acquistate
-        const catalogoAggiornato = catalogo.filter(opera => !codiciAcquistati.includes(opera.codice));
+        const catalogoAggiornato = catalogo;
         
         // Riscrivi il catalogo aggiornato
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ArrowFunction
ServerCliente.js:347:52
         const codiciAcquistati = validi.map(p => p.codice);
         
         // Filtra il catalogo mantenendo solo le opere NON acquistate
-        const catalogoAggiornato = catalogo.filter(opera => !codiciAcquistati.includes(opera.codice));
+        const catalogoAggiornato = catalogo.filter(() => undefined);
         
         // Riscrivi il catalogo aggiornato
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:350:86
         const catalogoAggiornato = catalogo.filter(opera => !codiciAcquistati.includes(opera.codice));
         
         // Riscrivi il catalogo aggiornato
-        fs.writeFileSync(opereFilePath, JSON.stringify(catalogoAggiornato, null, 2), 'utf-8');
+        fs.writeFileSync(opereFilePath, JSON.stringify(catalogoAggiornato, null, 2), "");
         console.log(`Opere rimosse dal catalogo: ${codiciAcquistati.join(', ')}`);
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:355:14
     }
     // ---------------------------------------------
 
-    res.json({ message: alertMessage, ordine: resultOrdine });
+    res.json({});
   } catch (error) {
     console.error("Errore durante l'acquisto:", error);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:356:19
     // ---------------------------------------------
 
     res.json({ message: alertMessage, ordine: resultOrdine });
-  } catch (error) {
-    console.error("Errore durante l'acquisto:", error);
-    res.status(500).json({ message: 'Errore durante la gestione della richiesta' });
-  }
+  } catch (error) {}
 });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] StringLiteral
ServerCliente.js:358:37
     res.json({ message: alertMessage, ordine: resultOrdine });
   } catch (error) {
     console.error("Errore durante l'acquisto:", error);
-    res.status(500).json({ message: 'Errore durante la gestione della richiesta' });
+    res.status(500).json({ message: "" });
   }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:358:26
     res.json({ message: alertMessage, ordine: resultOrdine });
   } catch (error) {
     console.error("Errore durante l'acquisto:", error);
-    res.status(500).json({ message: 'Errore durante la gestione della richiesta' });
+    res.status(500).json({});
   }
 });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:363:70
 });
 
 // RIMUOVI DAL CARRELLO
-app.post('/rimuoviCarrello', requireClienteAuth, async (req, res) => {
-  try {
-    const condition = { nome: req.nomeAutenticato, codice: req.body.codice };
-    const result = await Carrello.findOne(condition);
-
-    if (result) {
-      await Carrello.deleteOne(condition);
-      res.json({ message: 'Riepilogo opera eliminata:', nome: req.nomeAutenticato, codice: req.body.codice });
-    } else {
-      res.status(404).json({ message: 'Elemento non presente nel carrello' });
-    }
-  } catch (error) {
-    console.error("Errore rimozione carrello:", error);
-    res.status(500).json({ message: "Errore durante l'operazione" });
-  }
-});
+app.post('/rimuoviCarrello', requireClienteAuth, async (req, res) => {});
 
 // VISUALIZZA CARRELLO
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:364:7
 
 // RIMUOVI DAL CARRELLO
 app.post('/rimuoviCarrello', requireClienteAuth, async (req, res) => {
-  try {
-    const condition = { nome: req.nomeAutenticato, codice: req.body.codice };
-    const result = await Carrello.findOne(condition);
-
-    if (result) {
-      await Carrello.deleteOne(condition);
-      res.json({ message: 'Riepilogo opera eliminata:', nome: req.nomeAutenticato, codice: req.body.codice });
-    } else {
-      res.status(404).json({ message: 'Elemento non presente nel carrello' });
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.error("Errore rimozione carrello:", error);
     res.status(500).json({ message: "Errore durante l'operazione" });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:365:23
 // RIMUOVI DAL CARRELLO
 app.post('/rimuoviCarrello', requireClienteAuth, async (req, res) => {
   try {
-    const condition = { nome: req.nomeAutenticato, codice: req.body.codice };
+    const condition = {};
     const result = await Carrello.findOne(condition);
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:368:9
     const condition = { nome: req.nomeAutenticato, codice: req.body.codice };
     const result = await Carrello.findOne(condition);
 
-    if (result) {
+    if (true) {
       await Carrello.deleteOne(condition);
       res.json({ message: 'Riepilogo opera eliminata:', nome: req.nomeAutenticato, codice: req.body.codice });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:368:17
     const condition = { nome: req.nomeAutenticato, codice: req.body.codice };
     const result = await Carrello.findOne(condition);
 
-    if (result) {
-      await Carrello.deleteOne(condition);
-      res.json({ message: 'Riepilogo opera eliminata:', nome: req.nomeAutenticato, codice: req.body.codice });
-    } else {
+    if (result) {} else {
       res.status(404).json({ message: 'Elemento non presente nel carrello' });
     }
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:371:12
     if (result) {
       await Carrello.deleteOne(condition);
       res.json({ message: 'Riepilogo opera eliminata:', nome: req.nomeAutenticato, codice: req.body.codice });
-    } else {
-      res.status(404).json({ message: 'Elemento non presente nel carrello' });
-    }
+    } else {}
   } catch (error) {
     console.error("Errore rimozione carrello:", error);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:372:28
       await Carrello.deleteOne(condition);
       res.json({ message: 'Riepilogo opera eliminata:', nome: req.nomeAutenticato, codice: req.body.codice });
     } else {
-      res.status(404).json({ message: 'Elemento non presente nel carrello' });
+      res.status(404).json({});
     }
   } catch (error) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:374:19
     } else {
       res.status(404).json({ message: 'Elemento non presente nel carrello' });
     }
-  } catch (error) {
-    console.error("Errore rimozione carrello:", error);
-    res.status(500).json({ message: "Errore durante l'operazione" });
-  }
+  } catch (error) {}
 });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:381:73
 });
 
 // VISUALIZZA CARRELLO
-app.post('/visualizzaCarrello', requireClienteAuth, async (req, res) => {
-  try {
-    const nomeUtente = req.nomeAutenticato;
-    const carrello = await Carrello.find({ nome: nomeUtente });
-    if (carrello.length > 0) {
-      res.json({ carrello });
-    } else {
-      res.json({ message: "Il carrello dell'utente è vuoto" });
-    }
-  } catch (error) {
-    console.error('Errore visualizzazione carrello:', error);
-    res.status(500).json({ message: 'Errore durante la gestione della richiesta' });
-  }
-});
+app.post('/visualizzaCarrello', requireClienteAuth, async (req, res) => {});
 
 // ACQUISTA
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:382:7
 
 // VISUALIZZA CARRELLO
 app.post('/visualizzaCarrello', requireClienteAuth, async (req, res) => {
-  try {
-    const nomeUtente = req.nomeAutenticato;
-    const carrello = await Carrello.find({ nome: nomeUtente });
-    if (carrello.length > 0) {
-      res.json({ carrello });
-    } else {
-      res.json({ message: "Il carrello dell'utente è vuoto" });
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.error('Errore visualizzazione carrello:', error);
     res.status(500).json({ message: 'Errore durante la gestione della richiesta' });
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] EqualityOperator
ServerCliente.js:385:9
   try {
     const nomeUtente = req.nomeAutenticato;
     const carrello = await Carrello.find({ nome: nomeUtente });
-    if (carrello.length > 0) {
+    if (carrello.length >= 0) {
       res.json({ carrello });
     } else {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ConditionalExpression
ServerCliente.js:385:9
   try {
     const nomeUtente = req.nomeAutenticato;
     const carrello = await Carrello.find({ nome: nomeUtente });
-    if (carrello.length > 0) {
+    if (true) {
       res.json({ carrello });
     } else {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:387:12
     const carrello = await Carrello.find({ nome: nomeUtente });
     if (carrello.length > 0) {
       res.json({ carrello });
-    } else {
-      res.json({ message: "Il carrello dell'utente è vuoto" });
-    }
+    } else {}
   } catch (error) {
     console.error('Errore visualizzazione carrello:', error);
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] ObjectLiteral
ServerCliente.js:388:16
     if (carrello.length > 0) {
       res.json({ carrello });
     } else {
-      res.json({ message: "Il carrello dell'utente è vuoto" });
+      res.json({});
     }
   } catch (error) {
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:390:19
     } else {
       res.json({ message: "Il carrello dell'utente è vuoto" });
     }
-  } catch (error) {
-    console.error('Errore visualizzazione carrello:', error);
-    res.status(500).json({ message: 'Errore durante la gestione della richiesta' });
-  }
+  } catch (error) {}
 });
 
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001

[Killed] BlockStatement
ServerCliente.js:448:24
 // });
 
 // Avvio nativo dell'applicazione Express
-app.listen(PORT, () => {
-  console.log(`Server Cliente in ascolto sulla porta ${PORT}`);
-});
+app.listen(PORT, () => {});
killedBy: All tests
statusReason: node:events:502
      throw er; // Unhandled 'error' event
      ^

Error: listen EADDRINUSE: address already in use :::3001
